<?xml version="1.0" ?>
<net name="robust" version="10">
	<layers>
		<layer id="0" name="src" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 1080, 1920"/>
			<output>
				<port id="0" names="src" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="src/reverse_input_channels31508/Split_input_port_1/value3152235262" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="2" name="src/reverse_input_channels31508/Split" type="Split" version="opset1">
			<data num_splits="3"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="src/reverse_input_channels31508/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="src/scale_input_port_1/value3275" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="src/scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Resize_1/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="6119" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1059" type="Const" version="opset1">
			<data element_type="f32" offset="14" shape="4" size="16"/>
			<output>
				<port id="0" names="1059" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Resize_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Resize_1/Add_input_port_1/value611834971" type="Const" version="opset1">
			<data element_type="f32" offset="30" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Resize_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Resize_1/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="6123" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Resize_1/StridedSlice_sizes_input_port_1/value610034878" type="Const" version="opset1">
			<data element_type="i64" offset="34" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Resize_1/StridedSlice_sizes_input_port_2/value610235850" type="Const" version="opset1">
			<data element_type="i64" offset="42" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Resize_1/StridedSlice_sizes_input_port_3/value610436027" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Resize_1/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Resize_1/StridedSlice_scales613035991" type="Const" version="opset1">
			<data element_type="f32" offset="50" shape="2" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Resize_1/axis611435886" type="Const" version="opset1">
			<data element_type="i64" offset="58" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Resize_1" type="Interpolate" version="opset4">
			<data antialias="false" coordinate_transformation_mode="pytorch_half_pixel" cube_coeff="-0.75" mode="linear_onnx" nearest_mode="floor" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" shape_calculation_mode="scales"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="291" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ReduceMean_514/axis" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ReduceMean_514" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="890" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Concat_515" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="2" names="891" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_mul_14390" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Div_5/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_14392" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Sub_3/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="295" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="955" type="Const" version="opset1">
			<data element_type="f16" offset="86" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" names="955" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_6/Dims7663" type="Const" version="opset1">
			<data element_type="f16" offset="950" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="954" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_7" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="298" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="299" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Clip_11" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="302" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_12" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="303" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Div_13" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="304" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Mul_14" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" names="305" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="958" type="Const" version="opset1">
			<data element_type="f16" offset="986" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="958" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_15/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_15/Dims7795" type="Const" version="opset1">
			<data element_type="f16" offset="1274" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="957" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Constant_16" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="308" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Add_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="309" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Clip_20" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="312" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Constant_21" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="313" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Div_22" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="314" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Mul_23" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" names="315" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="961" type="Const" version="opset1">
			<data element_type="f16" offset="1306" shape="32, 16, 1, 1" size="1024"/>
			<output>
				<port id="0" names="961" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_24/Dims7765" type="Const" version="opset1">
			<data element_type="f16" offset="2330" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="960" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Constant_25" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="318" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Add_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="319" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Clip_29" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="322" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_30" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="323" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Div_31" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="324" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Mul_32" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" names="325" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="964" type="Const" version="opset1">
			<data element_type="f16" offset="2394" shape="32, 1, 1, 3, 3" size="576"/>
			<output>
				<port id="0" names="964" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_33/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_33/Dims7939" type="Const" version="opset1">
			<data element_type="f16" offset="2970" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_33" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="963" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Constant_34" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="328" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Add_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="329" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Clip_38" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="332" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_39" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="333" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Div_40" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="334" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Mul_41" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" names="335" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="967" type="Const" version="opset1">
			<data element_type="f16" offset="3034" shape="64, 32, 1, 1" size="4096"/>
			<output>
				<port id="0" names="967" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_42/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_42/Dims7801" type="Const" version="opset1">
			<data element_type="f16" offset="7130" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_42" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="966" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Constant_43" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="338" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Add_44" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="339" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Clip_47" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="342" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_48" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="343" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Div_49" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="344" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Mul_50" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" names="345" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="970" type="Const" version="opset1">
			<data element_type="f16" offset="7258" shape="64, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="970" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_51/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_51/Dims7759" type="Const" version="opset1">
			<data element_type="f16" offset="8410" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="969" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_52" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="348" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Add_53" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="349" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Clip_56" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="352" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Constant_57" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="353" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Div_58" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="354" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Mul_59" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" names="355" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="973" type="Const" version="opset1">
			<data element_type="f16" offset="8538" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="973" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Conv_60/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Conv_60/Dims7819" type="Const" version="opset1">
			<data element_type="f16" offset="16730" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Conv_60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="972" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Constant_61" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="358" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Add_62" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="359" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Clip_65" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="362" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_66" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="363" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Div_67" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="364" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Mul_68" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" names="365" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="976" type="Const" version="opset1">
			<data element_type="f16" offset="16858" shape="64, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="976" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_69/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_69/Dims7717" type="Const" version="opset1">
			<data element_type="f16" offset="18010" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_69" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="975" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_70" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="368" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Add_71" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="369" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Clip_74" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="372" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Constant_75" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="373" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Div_76" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="374" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Mul_77" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" names="375" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="979" type="Const" version="opset1">
			<data element_type="f16" offset="18138" shape="128, 64, 1, 1" size="16384"/>
			<output>
				<port id="0" names="979" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_78/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_78/Dims7879" type="Const" version="opset1">
			<data element_type="f16" offset="34522" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_78" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="978" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="Constant_79" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="378" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Add_80" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="379" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Clip_83" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="382" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_84" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="383" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Div_85" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="384" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Mul_86" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
