<?xml version="1.0" ?>
<net name="robust" version="10">
	<layers>
		<layer id="0" name="src" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 3, 1080, 1920"/>
			<output>
				<port id="0" names="src" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="src/reverse_input_channels36042/Split_input_port_1/value3605640700" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="2" name="src/reverse_input_channels36042/Split" type="Split" version="opset1">
			<data num_splits="3"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="I64"/>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="4" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="src/reverse_input_channels36042/Concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="src/scale_input_port_1/value3843" type="Const" version="opset1">
			<data element_type="f16" offset="8" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="src/scale" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Resize_1/ShapeOf" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="7163" type="Convert" version="opset1">
			<data destination_type="f32"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="1247" type="Const" version="opset1">
			<data element_type="f32" offset="14" shape="4" size="16"/>
			<output>
				<port id="0" names="1247" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Resize_1/Mul" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Resize_1/Add_input_port_1/value716240958" type="Const" version="opset1">
			<data element_type="f32" offset="30" shape="1" size="4"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Resize_1/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Resize_1/Floor" type="Floor" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="7167" type="Convert" version="opset1">
			<data destination_type="i64"/>
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Resize_1/StridedSlice_sizes_input_port_1/value714441222" type="Const" version="opset1">
			<data element_type="i64" offset="34" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Resize_1/StridedSlice_sizes_input_port_2/value714641219" type="Const" version="opset1">
			<data element_type="i64" offset="42" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Resize_1/StridedSlice_sizes_input_port_3/value714841075" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Resize_1/StridedSlice_sizes" type="StridedSlice" version="opset1">
			<data begin_mask="0" ellipsis_mask="0" end_mask="0" new_axis_mask="0" shrink_axis_mask="0"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Resize_1/StridedSlice_scales717440298" type="Const" version="opset1">
			<data element_type="f32" offset="50" shape="2" size="8"/>
			<output>
				<port id="0" precision="FP32">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Resize_1/axis715840616" type="Const" version="opset1">
			<data element_type="i64" offset="58" shape="2" size="16"/>
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Resize_1" type="Interpolate" version="opset4">
			<data antialias="false" coordinate_transformation_mode="pytorch_half_pixel" cube_coeff="-0.75" mode="linear_onnx" nearest_mode="floor" pads_begin="0, 0, 0, 0" pads_end="0, 0, 0, 0" shape_calculation_mode="scales"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1080</dim>
					<dim>1920</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="FP32">
					<dim>2</dim>
				</port>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="4" names="385" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="ReduceMean_532/axis" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="ReduceMean_532" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1021" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Concat_533" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1022" precision="FP16">
					<dim>1</dim>
					<dim>4</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_mul_16530" type="Const" version="opset1">
			<data element_type="f16" offset="74" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Div_5/Fused_Mul_" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="data_add_16532" type="Const" version="opset1">
			<data element_type="f16" offset="80" shape="1, 3, 1, 1" size="6"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Sub_3/Fused_Add_" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="389" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="1086" type="Const" version="opset1">
			<data element_type="f16" offset="86" shape="16, 3, 3, 3" size="864"/>
			<output>
				<port id="0" names="1086" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_6/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>270</dim>
					<dim>480</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Conv_6/Dims9289" type="Const" version="opset1">
			<data element_type="f16" offset="950" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Conv_6" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1085" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_7" type="Const" version="opset1">
			<data element_type="f16" offset="982" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="392" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Add_8" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="393" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Clip_11" type="Clamp" version="opset1">
			<data max="6" min="0"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="396" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_12" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="397" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Div_13" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="398" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Mul_14" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" names="399" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="1089" type="Const" version="opset1">
			<data element_type="f16" offset="986" shape="16, 1, 1, 3, 3" size="288"/>
			<output>
				<port id="0" names="1089" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_15/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_15/Dims9139" type="Const" version="opset1">
			<data element_type="f16" offset="1274" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Conv_15" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1088" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Relu_16" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="402" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="1092" type="Const" version="opset1">
			<data element_type="f16" offset="1306" shape="16, 16, 1, 1" size="512"/>
			<output>
				<port id="0" names="1092" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_17/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_17/Dims9061" type="Const" version="opset1">
			<data element_type="f16" offset="1818" shape="1, 16, 1, 1" size="32"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_17" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1091" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Add_18" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="2" names="405" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="1095" type="Const" version="opset1">
			<data element_type="f16" offset="1850" shape="64, 16, 1, 1" size="2048"/>
			<output>
				<port id="0" names="1095" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_19/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_19/Dims9193" type="Const" version="opset1">
			<data element_type="f16" offset="3898" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_19" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1094" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Relu_20" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</input>
			<output>
				<port id="1" names="408" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="1098" type="Const" version="opset1">
			<data element_type="f16" offset="4026" shape="64, 1, 1, 3, 3" size="1152"/>
			<output>
				<port id="0" names="1098" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_21/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>135</dim>
					<dim>240</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_21/Dims9175" type="Const" version="opset1">
			<data element_type="f16" offset="5178" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_21" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1097" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Relu_22" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="411" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="1101" type="Const" version="opset1">
			<data element_type="f16" offset="5306" shape="24, 64, 1, 1" size="3072"/>
			<output>
				<port id="0" names="1101" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_23/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_23/Dims9337" type="Const" version="opset1">
			<data element_type="f16" offset="8378" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_23" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1100" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="1104" type="Const" version="opset1">
			<data element_type="f16" offset="8426" shape="72, 24, 1, 1" size="3456"/>
			<output>
				<port id="0" names="1104" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Conv_24/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_24/Dims9307" type="Const" version="opset1">
			<data element_type="f16" offset="11882" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_24" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1103" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Relu_25" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="416" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="1107" type="Const" version="opset1">
			<data element_type="f16" offset="12026" shape="72, 1, 1, 3, 3" size="1296"/>
			<output>
				<port id="0" names="1107" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Conv_26/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Conv_26/Dims8905" type="Const" version="opset1">
			<data element_type="f16" offset="13322" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_26" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1106" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Relu_27" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="419" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="1110" type="Const" version="opset1">
			<data element_type="f16" offset="13466" shape="24, 72, 1, 1" size="3456"/>
			<output>
				<port id="0" names="1110" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Conv_28/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Conv_28/Dims9067" type="Const" version="opset1">
			<data element_type="f16" offset="16922" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_28" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1109" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Add_29" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="2" names="422" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="1113" type="Const" version="opset1">
			<data element_type="f16" offset="16970" shape="72, 24, 1, 1" size="3456"/>
			<output>
				<port id="0" names="1113" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Conv_30/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Conv_30/Dims9325" type="Const" version="opset1">
			<data element_type="f16" offset="20426" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Conv_30" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1112" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Relu_31" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1" names="425" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="1116" type="Const" version="opset1">
			<data element_type="f16" offset="20570" shape="72, 1, 1, 5, 5" size="3600"/>
			<output>
				<port id="0" names="1116" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_32/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>68</dim>
					<dim>120</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Conv_32/Dims8947" type="Const" version="opset1">
			<data element_type="f16" offset="24170" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Conv_32" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1115" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Relu_33" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="428" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="873" type="Const" version="opset1">
			<data element_type="i64" offset="34" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="88" name="GlobalAveragePool_34/input_rank/shape_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="GlobalAveragePool_34/input_rank/rank_of" type="ShapeOf" version="opset3">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="GlobalAveragePool_34/input_rank/0d_rank_of/value" type="Const" version="opset1">
			<data element_type="i64" offset="24314" shape="1" size="8"/>
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="GlobalAveragePool_34/input_rank" type="Squeeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64"/>
			</output>
		</layer>
		<layer id="92" name="875" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="" size="8"/>
			<output>
				<port id="0" precision="I64"/>
			</output>
		</layer>
		<layer id="93" name="GlobalAveragePool_34/global_pooling_reduce_axis" type="Range" version="opset4">
			<data output_type="i64"/>
			<input>
				<port id="0" precision="I64"/>
				<port id="1" precision="I64"/>
				<port id="2" precision="I64"/>
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="GlobalAveragePool_34/reduce" type="ReduceMean" version="opset1">
			<data keep_dims="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" names="429" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="backbone.features.4.block.2.fc1.weight" type="Const" version="opset1">
			<data element_type="f16" offset="24322" shape="24, 72, 1, 1" size="3456"/>
			<output>
				<port id="0" names="backbone.features.4.block.2.fc1.weight" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Conv_35/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>24</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Conv_35/Dims8917" type="Const" version="opset1">
			<data element_type="f16" offset="27778" shape="1, 24, 1, 1" size="48"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_35" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="430" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Relu_36" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" names="431" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="backbone.features.4.block.2.fc2.weight" type="Const" version="opset1">
			<data element_type="f16" offset="27826" shape="72, 24, 1, 1" size="3456"/>
			<output>
				<port id="0" names="backbone.features.4.block.2.fc2.weight" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Conv_37/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>72</dim>
					<dim>24</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Conv_37/Dims8959" type="Const" version="opset1">
			<data element_type="f16" offset="31282" shape="1, 72, 1, 1" size="144"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_37" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="432" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="HardSigmoid_38/HardSigmoid__input_port_1/value" type="Const" version="opset1">
			<data element_type="f16" offset="984" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="105" name="HardSigmoid_38/HardSigmoid__input_port_2/value" type="Const" version="opset1">
			<data element_type="f16" offset="31426" shape="" size="2"/>
			<output>
				<port id="0" precision="FP16"/>
			</output>
		</layer>
		<layer id="106" name="HardSigmoid_38/HardSigmoid_" type="HardSigmoid" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16"/>
				<port id="2" precision="FP16"/>
			</input>
			<output>
				<port id="3" names="433" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="Mul_39" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="2" names="434" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="1119" type="Const" version="opset1">
			<data element_type="f16" offset="31428" shape="40, 72, 1, 1" size="5760"/>
			<output>
				<port id="0" names="1119" precision="FP16">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_40/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>72</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>40</dim>
					<dim>72</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_40/Dims9007" type="Const" version="opset1">
			<data element_type="f16" offset="37188" shape="1, 40, 1, 1" size="80"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Conv_40" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1118" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="1122" type="Const" version="opset1">
			<data element_type="f16" offset="37268" shape="120, 40, 1, 1" size="9600"/>
			<output>
				<port id="0" names="1122" precision="FP16">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_41/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>40</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>40</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_41/Dims8929" type="Const" version="opset1">
			<data element_type="f16" offset="46868" shape="1, 120, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Conv_41" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="1121" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Relu_42" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</input>
			<output>
				<port id="1" names="439" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="1125" type="Const" version="opset1">
			<data element_type="f16" offset="47108" shape="120, 1, 1, 5, 5" size="6000"/>
			<output>
				<port id="0" names="1125" precision="FP16">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Conv_43/WithoutBiases" type="GroupConvolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Conv_43/Dims9169" type="Const" version="opset1">
			<data element_type="f16" offset="53108" shape="1, 120, 1, 1" size="240"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="Conv_43" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
					<dim>34</dim>
					<dim>60</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>120</dim>
